"""
坐标配置信息
"""

coordinate_info = {
    # 关闭按钮
    "close_btn": {
        "x": 0.9734,
        "y": 0.0444
    },
    # 主窗口副本按钮
    "dungeon_main": {
        "x": 0.834,
        "y": 0.045
    },
    # 弹窗副本tab页
    "dungeon_tab": {
        "x": 0.309,
        "y": 0.194
    },
    # 基础副本选项
    "base_row": {
        "x": 0.286,
        "y": 0.451
    },
    # 技能材料副本选项
    "skill_row": {
        "x": -1,
        "y": -1
    },
    # 晋级材料副本选项
    "rank_row": {
        "x": -1,
        "y": -1
    },
    # 遗器副本选项
    "equip_row": {
        "x": -1,
        "y": -1
    },
    # 周本选项
    "weekend_row": {
        "x": -1,
        "y": -1
    },

    # 副本结束重试按钮
    "dungeon_retry": {
        "x": -1,
        "y": -1
    },
    # 副本结束退出按钮
    "dungeon_exit": {
        "x": 0.3769,
        "y": 0.8784
    },
    # 挑战开始按钮
    "action_btn": {
        "x": 0.85,
        "y": 0.9
    },
    # 挑战次数按钮
    "action_count_btn": {
        "x": 0.95,
        "y": 0.83
    },

    # 角色经验-传送
    "exp_run_btn": {
        "x": 0.787,
        "y": 0.459
    },
    # 武器经验-传送
    "weapon_run_btn": {
        "x": 0.787,
        "y": 0.641
    },
    # 信用点-传送
    "money_run_btn": {
        "x": 0.787,
        "y": 0.828
    }
}
